W5D2/reddit/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.author_id = current_user.id
    @comment.post_id = params[:post_id]
    if @comment.save
---
INSERT INTO "comments" ("content", "author_id", "post_id", "created_at", "updated_at", "parent_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "d"], ["author_id", 2], ["post_id", 1], ["created_at", "2017-12-05 22:18:00.770941"], ["updated_at", "2017-12-05 22:18:00.770941"], ["parent_id", 1]]