W5D2/reddit/app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "posts" SET "title" = $1, "url" = $2, "content" = $3, "updated_at" = $4 WHERE "posts"."id" = $5  [["title", "aasdfasd"], ["url", "aasdf"], ["content", "adfsa"], ["updated_at", "2017-12-05 21:03:58.419434"], ["id", 7]]
---
  def update
    @post = Post.find(params[:id])
    debugger
    if @post.update(post_params)