W5D2/reddit/app/controllers/subs_controller.rb

  def update
    if @current_sub.update(sub_params)
---
UPDATE "subs" SET "description" = $1, "updated_at" = $2 WHERE "subs"."id" = $3  [["description", "TESTESTESTESTEST"], ["updated_at", "2017-12-05 17:28:04.838587"], ["id", 2]]

  def show
    @current_sub = Sub.find(params[:id])
---
SELECT  "subs".* FROM "subs" WHERE "subs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]