W5D2/reddit/app/views/posts/_comment.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 1]]
---
  <ul>
    <% comment.comments.each do |comment| %>