W5D2/reddit/app/views/posts/edit.html.erb

  <input type="hidden" name="post[sub_ids][]" value="">
  <% Sub.all.each do |sub| %>
  <label>
    <input <%= 'checked' if @post.subs.include?(sub) %> type="checkBox" name="post[sub_ids][]" value="<%= sub.id %>">
---
SELECT "subs".* FROM "subs"
SELECT  1 AS one FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1 AND "subs"."id" = $2 LIMIT $3  [["post_id", 7], ["id", 1], ["LIMIT", 1]]