W4D3/app/views/cats/show.html.erb

  </tr>
  <% @cat.rental_requests2.order('start_date').each do |req| %>
---
SELECT "cat_rental_requests".* FROM "cat_rental_requests" WHERE "cat_rental_requests"."cat_id" = $1 ORDER BY start_date  [["cat_id", 1]]